# language: ru
Функционал: Тестовое задание

  Сценарий: Тест

    Дано открыть сайт google.ru
    Тогда проверить, что появилось поле поиск
    Тогда ввести в поле поиск значение "Центральный банк РФ"
    Тогда нажать на кнопку Поиск в google
    Тогда найти ссылку "cbr.ru"
    Тогда нажать на ссылку "cbr.ru"
    Тогда проверить, что открыт сайт Центрального банка РФ
    Тогда нажать на кнопку Интернет-приемная
    Тогда открыть раздел Написать благодарность
    Тогда ввести в поле Ваша благодарность значение "случайный текст"
    Тогда поставить галочку Я согласен
    Тогда сделать скриншот
    Тогда нажать на кнопку Три полоски
    Тогда нажать на раздел О сайте
    Тогда нажать на ссылку Предупреждение
    Тогда запомнить текст предупреждения
    Тогда сменить язык страницы на EN
    Тогда проверить, что текст отличается от запомненного ранее
    Тогда сделать скриншот