# language: ru
Функционал: Тестовое задание

  Сценарий: Тест

    Дано открыт сайт "google.ru"
    Тогда проверить, что появилось поле "поиск"
    Тогда ввести в поле "поиск" значение "Центральный банк РФ"
    Тогда нажать на "Поиск в google"
    Тогда найти ссылку "cbr.ru"
    Тогда нажать на "cbr.ru"
    Тогда проверить, что открыт "сайт Центрального банка РФ"
    Тогда нажать на "Интернет-приемная"
    Тогда нажать на "Написать благодарность"
    Тогда ввести в поле "Ваша благодарность" значение "случайный текст"
    Тогда поставить галочку "Я согласен"
    Тогда сделать скриншот
    Тогда нажать на "Три полоски"
    Тогда нажать на "О сайте"
    Тогда нажать на "Предупреждение"
    Тогда запомнить текст предупреждения
    Тогда сменить язык на "EN"
    Тогда проверить, что текст изменился
    Тогда сделать скриншот